<!--
 * @Explain: xxx
 * @Author: SuperLy
 * @LastEditors: LiuYang 2472104875@qq.com
 * @Date: 2022-05-30 12:24:22
 * @LastEditTime: 2024-08-15 10:12:54
 * @FilePath: \lb-audio-v3\src\App.vue
-->

<template>
    <lbAudio
        class="music-player"
        :musicList="musicList"
        :index="0"
        :lyrics="true"
    >
    </lbAudio>

    <button style="margin-top: 500px" @click="add">添加</button>
</template>
<script setup lang="ts">
import lbAudio, { type musicListType } from "@/Audio";
import { ref } from "vue";
const musicList = ref<musicListType>([
    {
        name: "海底",
        author: "一支榴莲",
        url: "https://music.163.com/song/media/outer/url?id=1430583016.mp3",
        img: "https://p1.music.126.net/YRFYXG6YaJfTyy_mQntS4A==/109951164799337803.jpg",
        lrc: ` \n[00:01.935]混音：小黑Voc[00:24.104]\n散落的月光穿过了云\n[00:33.073]躲着人群\n[00:37.493]铺成大海的鳞\n[00:41.549]海浪打湿白裙\n[00:44.061]试图推你回去\n
		[00:50.225]海浪清洗血迹\n
		[00:53.099]妄想温暖你\n
		[00:58.784]往海的深处听\n
		[01:03.107]谁的哀鸣在指引\n
		[01:08.156]灵魂没入寂静\n
		[01:10.945]无人将你吵醒\n
		[01:15.715]\n
		[01:16.825]你喜欢海风咸咸的气息\n
		[01:19.727]踩着湿湿的沙砾\n
		[01:22.111]你说人们的骨灰应该撒进海里\n
		[01:25.823]你问我死后会去哪里\n
		[01:28.593]有没有人爱你\n
		[01:30.807]世界能否不再\n
		[01:34.907]总爱对凉薄的人扯着笑脸\n
		[01:39.132]岸上人们脸上都挂着无关\n
		[01:43.875]人间毫无留恋\n
		[01:46.393]一切散为烟\n
		[01:51.403]\n
		[02:24.079]散落的月光穿过了云\n
		[02:33.253]躲着人群\n
		[02:37.412]溜进海底\n
		[02:41.538]海浪清洗血迹\n
		[02:44.119]妄想温暖你\n
		[02:50.149]灵魂没入寂静\n
		[02:52.902]无人将你吵醒\n
		[02:57.263]\n
		[02:59.083]你喜欢海风咸咸的气息\n
		[03:01.949]踩着湿湿的沙砾\n
		[03:04.256]你说人们的骨灰应该撒进海里\n
		[03:07.777]你问我死后会去哪里\n
		[03:10.830]有没有人爱你\n
		[03:13.080]世界已然将你抛弃\n
		[03:17.050]总爱对凉薄的人扯着笑脸\n
		[03:21.252]岸上人们脸上都挂着无关\n
		[03:25.746]人间毫无留恋\n
		[03:28.514]一切散为烟\n
		[03:32.461]\n
		[03:34.241]来不及来不及\n
		[03:38.556]你曾笑着哭泣\n
		[03:43.078]来不及来不及\n
		[03:47.684]你颤抖的手臂\n
		[03:51.923]来不及来不及\n
		[03:56.428]无人将你打捞起\n
		[04:00.828]来不及来不及\n
		[04:05.127]你明明讨厌窒息`,
    },
]);
const add = () => {
    musicList.value = [
        {
            name: "水星记",
            author: "郭顶",
            url: "https://music.163.com/song/media/outer/url?id=441491828.mp3",
            img: "https://p2.music.126.net/wSMfGvFzOAYRU_yVIfquAA==/2946691248081599.jpg",
            lrc: `[00:19.200]着迷于你眼睛\n[00:21.510]\n[00:22.910]银河有迹可循\n[00:25.040]\n[00:26.160]穿过时间的缝隙\n[00:28.980]\n[00:29.740]它依然真实地\n[00:32.750]\n[00:33.460]吸引我轨迹\n[00:36.230]\n[00:40.440]这瞬眼的光景\n[00:42.950]\n[00:43.970]最亲密的距离\n[00:46.550]\n[00:47.470]沿着你皮肤纹理 \n[00:51.380]走过曲折手臂\n[00:54.040]\n[00:54.960]做个梦给你\n[00:57.230]\n[00:58.580]做个梦给你\n[01:01.249]\n[01:03.668]等到看你银色满际\n[01:06.260]\n[01:07.069]等到分不清季节更替\n[01:11.590]\n[01:12.938]才敢说沉溺\n[01:16.078]\n[01:19.980]还要多远才能进入你的心\n[01:26.200]\n[01:27.170]还要多久才能和你接近\n[01:33.310]\n[01:34.328]咫尺远近却\n[01:36.780]无法靠近的那个人\n[01:42.000]也等着和你相遇\n[01:47.610]\n[01:49.030]环游的行星\n[01:51.750]\n[01:52.269]怎么可以\n[01:55.170]\n[01:56.129]拥有你\n[01:57.989]\n[02:13.728]这瞬眼的光景\n[02:16.269]\n[02:17.119]最亲密的距离\n[02:19.679]\n[02:20.628]沿着你皮肤纹理\n[02:24.310]走过曲折手臂\n[02:27.359]\n[02:28.060]做个梦给你\n[02:30.478]\n[02:31.579]做个梦给你\n[02:34.619]\n[02:36.589]等到看你银色满际\n[02:40.288]等到分不清季节更替\n[02:44.660]\n[02:45.869]才敢说沉溺\n[02:53.138]还要多远才能进入你的心\n[02:59.399]\n[03:00.329]还要多久才能和你接近\n[03:06.478]\n[03:07.429]咫尺远近却\n[03:09.560]无法靠近的那个人\n[03:15.128]也等着和你相遇\n[03:20.638]\n[03:21.829]环游的行星\n[03:24.739]\n[03:25.388]怎么可以\n[03:29.079]拥有你\n[03:35.530]\n[04:05.218]还要多远才能进入你的心\n[04:10.869]\n[04:11.929]还要多久才能和你接近\n[04:18.028]\n[04:19.050]咫尺远近却无法靠近的那个人\n[04:26.687]要怎么探寻\n[04:30.319]要多么幸运\n[04:33.538]才敢让你发觉你并不孤寂\n[04:39.778]\n[04:40.509]当我还可以再跟你飞行\n[04:46.579]\n[04:47.690]环游是无趣\n[04:50.569]\n[04:51.339]至少可以\n[04:54.639]\n[04:55.240]陪着你`,
        },
    ];
};
</script>
<style>
.music-player {
    width: 320px;
    height: 64px;
}
</style>
