<!--
 * @Explain: xxx
 * @Author: SuperLy
 * @LastEditors: LiuYang 2472104875@qq.com
 * @Date: 2022-05-30 12:24:22
 * @LastEditTime: 2024-08-14 13:35:16
 * @FilePath: \lb-audio-v3\src\App.vue
-->

<template>
    <lbAudio
        class="music-player"
        :musicList="musicList"
        :index="0"
        :lyrics="true"
    >
    </lbAudio>
</template>
<script setup lang="ts">
import lbAudio, { type playOrderType, type musicListType } from "@/Audio";
const musicList = [
    {
        name: "海底",
        author: "一支榴莲",
        url: "https://music.163.com/song/media/outer/url?id=1430583016.mp3",
        img: "https://p1.music.126.net/YRFYXG6YaJfTyy_mQntS4A==/109951164799337803.jpg",
        lrc: ` \n[00:01.935]混音：小黑Voc[00:24.104]\n散落的月光穿过了云\n[00:33.073]躲着人群\n[00:37.493]铺成大海的鳞\n[00:41.549]海浪打湿白裙\n[00:44.061]试图推你回去\n
		[00:50.225]海浪清洗血迹\n
		[00:53.099]妄想温暖你\n
		[00:58.784]往海的深处听\n
		[01:03.107]谁的哀鸣在指引\n
		[01:08.156]灵魂没入寂静\n
		[01:10.945]无人将你吵醒\n
		[01:15.715]\n
		[01:16.825]你喜欢海风咸咸的气息\n
		[01:19.727]踩着湿湿的沙砾\n
		[01:22.111]你说人们的骨灰应该撒进海里\n
		[01:25.823]你问我死后会去哪里\n
		[01:28.593]有没有人爱你\n
		[01:30.807]世界能否不再\n
		[01:34.907]总爱对凉薄的人扯着笑脸\n
		[01:39.132]岸上人们脸上都挂着无关\n
		[01:43.875]人间毫无留恋\n
		[01:46.393]一切散为烟\n
		[01:51.403]\n
		[02:24.079]散落的月光穿过了云\n
		[02:33.253]躲着人群\n
		[02:37.412]溜进海底\n
		[02:41.538]海浪清洗血迹\n
		[02:44.119]妄想温暖你\n
		[02:50.149]灵魂没入寂静\n
		[02:52.902]无人将你吵醒\n
		[02:57.263]\n
		[02:59.083]你喜欢海风咸咸的气息\n
		[03:01.949]踩着湿湿的沙砾\n
		[03:04.256]你说人们的骨灰应该撒进海里\n
		[03:07.777]你问我死后会去哪里\n
		[03:10.830]有没有人爱你\n
		[03:13.080]世界已然将你抛弃\n
		[03:17.050]总爱对凉薄的人扯着笑脸\n
		[03:21.252]岸上人们脸上都挂着无关\n
		[03:25.746]人间毫无留恋\n
		[03:28.514]一切散为烟\n
		[03:32.461]\n
		[03:34.241]来不及来不及\n
		[03:38.556]你曾笑着哭泣\n
		[03:43.078]来不及来不及\n
		[03:47.684]你颤抖的手臂\n
		[03:51.923]来不及来不及\n
		[03:56.428]无人将你打捞起\n
		[04:00.828]来不及来不及\n
		[04:05.127]你明明讨厌窒息`,
    },
];
</script>
<style>
.music-player {
    width: 320px;
    height: 64px;
}
</style>
